In [1]:
# 모듈 불러오기
import pandas as pd

In [13]:
# 데이터 프레임 생성
friends = [
    {'age' : 15, 'job' : 'student'},
    {'age' : 25, 'job' : 'developer'},
    {'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'], columns = ['age', 'job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [14]:
# 행 삭제 by 행이름
df = df.drop(['John', 'Nate'])
df

       age        job
Jenny   25  developer

In [21]:
# 데이터 프레임 생성
df = pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'], columns = ['age', 'job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [22]:
# 행 삭제 by 행이름 + 데이터 프레임에 자동 대입
df.drop(['John', 'Nate'], inplace = True)
df

       age        job
Jenny   25  developer

In [25]:
# 데이터 프레임 생성
friends = [
    {'name' : 'John', 'age' : 15, 'job' : 'student'},
    {'name' : 'Ben', 'age' : 25, 'job' : 'developer'},
    {'name' : 'Jenny', 'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [27]:
# 행 삭제 by 인덱스
df = df.drop(df.index[[0, 1]])
df

    name  age      job
2  Jenny   30  teacher

In [29]:
# 데이터 프레임 생성
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [31]:
# 행 삭제 by 조건
df = df[df.age > 20]
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [32]:
# 데이터 프레임 생성
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [33]:
# 열 삭제 by 열이름
df = df.drop('age', axis = 1)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [34]:
# 데이터 프레임 생성
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [ ]:
# 열 삭제 by 열이름 + 데이터 프레임에 자동 대입
df.drop('age', axis = 1, inplace = True)
df